#+startup: overview
#+title: Linux_Shell脚本攻略
#+author: dream

*** 4.3.3 补充内容
    1. 递归搜索文件
       #+begin_src bash
	 grep "text" . -R -n
       #+end_src

    2. 忽略样式中的大小写
       选项-i可以使匹配样式不考虑字符的大小写,例如:
       #+begin_src bash
	 echo hello world | grep -i "HELLO"
       #+end_src

    3. 用grep匹配多个样式
       在进行匹配的时候通常只指定一个样式.然而,我们
       可以用选项-e来指定多个匹配样式:
       #+begin_src bash
	 grep -e "pattern1" -e "pattern"
       #+end_src

       例如:
       #+begin_src bash
	 echo this is a line of text | grep -e "this"\
	  -e "line" -o
       #+end_src

       还有另一种方法也可以指定多个样式.我们可以提供一个
       样式文件用于读取样式.在样式文件中逐行写下需要匹配
       样式,然后用选项-f选项执行grep:
       #+begin_src bash
	 grep -f pattern_file source_filename
       #+end_src

       #+begin_src bash
	 echo hello this is cool | grep -f pat_file
       #+end_src

    4. 在grep搜索中包括或排除文件
       在目录中递归搜索所有的.c和.cpp文件
       #+begin_src bash
	 grep "main()" . -r --include *.{c,cpp}
       #+end_src

       在搜索中排除所有的README文件:
       #+begin_src bash
	 grep "main()" . -r --exclude "README"
       #+end_src

       如果需要排除目录,可以使用--exclude-dir选项.
       如果需要从文件中读取所需排除的文件列表,使用
       --exclude-from FILE.

    5. 使用0值字节后缀的grep与xargs
       grep 输出以0值字节作为终结符的文件名(\0).这可以用grep的
       -Z选项来指定.
       #+begin_src bash
	 grep "test" file* -lZ | xargs -0 rm
       #+end_src

    6. grep的静默输出

    7. 打印出匹配文本之前或之后的行

       打印匹配某个结果之后的三行,使用-A选项:
       #+begin_src bash
	 seq 10 | grep 5 -A 3
       #+end_src

       打印匹配某个结果之前的三行,使用-B选项:
       #+begin_src bash
	 seq 10 | grep 5 -B 3
       #+end_src

       打印匹配某个结果之前及之后的3行,使用-C选项:
       #+begin_src bash
	 seq 10 | grep 5 -C 3
       #+end_src

       如果有多个匹配,那么以一行"--"作为各匹配之间的定界符:
       #+begin_src bash
	 echo -e "a\nb\nc\na\nb\nc" | grep a -A 1
       #+end_src

       #+RESULTS:
       | a  |
       | b  |
       | -- |
       | a  |
       | b  |

